# операции с целыми числами
print(11111*1111111)
# остаток от целочисленного деления
print(42%8)
# операция целочисленного деления
print(42//5)
# python выдает ошибку, делить на ноль нельзя
#a=(42/(4+2*(-2)))
#print(a)
# возведение в степень
print(2**2)
print(2014**14)

# операции с вещественными числами
# вещественное деление
print(5/2)
# python считатает с погрешностью (неточно)
print(0.3+0.3+0.3)
# возведение в степень 10в3
print(1.2345e3)
# возведение в степень 10в-3
print(1.2345e-3)

a=5.2
b=6
# print(int(a)) преобразование числа с плавающей запятой к целому (дробная часть отбрасывается)
print(int(a))
# print(float(b)) обратная ситуация, к целому числу добавлена дробная часть .0
print(float(b))

# читает строку с клавиатуры
input('Введите данные')
# вывод в переменную s веденных данных
s=input()
# вывод в переменную a введенных данных с преобразованием к целому числу
a=int(input())
print(a,s)

name = input('введите имя')
print('Привет', name)




